# ViewerCropRegionDisabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerCropRegionDisabled Property
ParameterTypeId Class See Also
---
"Crop View"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerCropRegionDisabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerCropRegionDisabled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerCropRegionDisabled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace